Revit 2027 API
MullionTypeSet.Contains Method
Tests for the existence of a mullion type within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	MullionType item
)
Public Overridable Function Contains (
	item As MullionType
) As Boolean
public:
virtual bool Contains(
	MullionType^ item
)
abstract Contains :
        item : MullionType -> bool
override Contains :
        item : MullionType -> bool
Parameters
item MullionType
The mullion type to be searched for.
Return Value
Boolean
The Contains method returns True if the mullion type is within the set, otherwise False.
See Also
Reference
MullionTypeSet Class
Autodesk.Revit.DB Namespace